import Image from 'next/image';

export default function Introduction() {
  return (
    <section className="container mx-auto px-4 py-4">
      <div className="flex flex-col items-center justify-between gap-6 md:gap-8">
        <div className="w-full">
          <h1 className="mb-6 text-3xl font-bold md:text-4xl">About Me</h1>
          <p className="mb-2 font-bold">नमस्कार,</p>
          <p className="mb-4 text-sm font-light md:text-lg">
            म गोपाल नेपाल मेरो स्थायी ठेगाना ओखलढुङ्गा जिल्ला मोलुङ गाउँपालिका
            वडा नं. ५ मा पर्छ। मेरो जन्म वि.स. २०५० साल चैत २५ गते भएको हो ।
            मेरो बुबा शिव प्रसाद नेपाल र आमा निर्मला नेपालको कोखबाट म जन्मिएको
            हु। स्वभाविक रूपमा वि.स. २०६५ सालमा श्री बरूणेश्वर माध्यमिक विद्यालय
            रामपुरबाट SLC परीक्षामा सम्मिलित भई उत्तिर्ण भएको हु । म ९ कक्षामा
            अध्ययनरत रहंदा जुनियर रेडक्रस सर्कलको अध्यक्ष पदमा निर्वाचित भएको
            थिए । उच्च शिक्षा प्राप्तिको शिलशिलामा म देशकै अग्रणी विज्ञान संकाय
            अध्ययन हुने क्याम्पस काठमाण्डौको मुटु ठमेलमा अवस्थित अमृत क्याम्पसमा
            वि.स. २०६६ सालमा प्रबिणता प्रमाणपत्र तहमा भर्ना भए ।वि.स. २०६८ मा
            प्रवीणता प्रमाणपत्र तह उत्तिर्ण गरि कम्प्युटर विज्ञान तथा सूचना
            प्रविधि बिषयमा स्नातक तहमा भर्ना भए। अमृत क्याम्पस रहँदा
            अनेरास्ववियुको कक्षा कमिटी सचिव, सह क्याम्पस कमिटी सचिव ,CSIT विभाग
            सचिब हुँदै क्याम्पस कमिटी सचिवको भूमिका कुशलतापूर्वक निर्बाह गरि
            विद्यार्थीहरुको बिचमा अहोरात्र कृयाशील भए । क्याम्पसमा संचालन हुने
            विभिन्न आन्दोलनको अग्र मोर्चामा रहेर भूमिका विर्बाह गरे ।हामिले
            अनेरास्ववियुबाट विभिन्न समयमा प्रकाशित हुने विद्यार्थीहरुको शैक्षिक
            सामाग्री Syllabus , Old is Gold शैक्षिक क्यालेन्डर प्रकाशनमा
            क्याम्पस कमिटीमा रहेर नेतृत्वदायी भूमिका निर्वाह गर्ने गर्थ्यौ ।
            नेपालमा पहिलो पटक Ascol Creative Group मार्फत Entrance Preparation
            Book for B.Sc. CSIT पुस्तक प्रकाशन गर्न सफल भए । मैले नेपाल ल
            क्याम्पस बाट कानूनमा स्नातक LLB र त्रिभूवन विश्वविद्यालयबाट राजनीति
            शास्त्रमा स्नातकोत्तर उत्तिर्ण गरेको छु । हाल केन्द्रीय क्याम्पस
            कीर्तिपुरमा कम्प्युटर विज्ञान तथा सूचना प्रविधि विभाग मा MIT
            अध्ययनरत छु । हाल म अनेरास्ववियु स्थायी कमिटी सदस्य एवं कानून तथा
            संघिय मामिला विभाग प्रमुख , कोशी प्रदेश सह -इन्चार्ज एवं नेकपा एमाले
            जिल्ला कमिटी ओखलढुङ्गाको जिल्ला कमिटी सदस्य पदमा कार्यरत छु ।म संग
            ओखलढुङ्गा जिल्ला मोलुङ गाउँपालिकामा ४.५ बर्ष सूचना प्रविधि अधिकृत
            एवं सूचना अधिकारी पदमा कार्यरत रहेको अनुभव छ । गुरु लुईंटेल अध्ययन
            तथा विकास केन्द्रको सचिब पदमा समेत कार्यरत रहेको छु ।
          </p>
        </div>

        <div className="mb-6 w-full max-w-[700px] md:order-2 md:mb-0">
          <div className="relative mx-auto max-w-sm md:max-w-none">
            <Image
              src="/about.webp"
              alt="Leader's Name"
              width={600}
              height={600}
              className="h-auto w-full rounded-lg shadow-md"
            />
          </div>
        </div>
      </div>
    </section>
  );
}
